<template>
    <div class="audio-wrapper">
        <div id="aplayer"></div>
    </div>
</template>

<script>
    /*https://aplayer.js.org/#/zh-Hans/*/
    import 'APlayer/dist/APlayer.min.css';
    import APlayer from 'APlayer';

    export default {
        name: "MyAudio",
        props: {},
        data() {
            return {
                aPlayer: null,
                musicList: [
                    {
                        name: '战之祭',
                        url: require('../public/audio/zzj.mp3'),
                        cover: require('../public/audio/AMIT2.jpg'),
                        artist: '张惠妹',
                        lrc: `[00:00.94]战之祭 - 张惠妹
                                    [01:32.61]无处不在的祖灵啊
                                    [01:36.85]请给我老鹰的羽翼
                                    [01:41.67]给我盘旋的冷静
                                    [01:45.46]给我攻击的力量
                                    [01:50.77]我离开 我从来没有离开
                                    [01:56.95]我坚强 我从来不够坚强
                                    [02:03.51]我愤怒 我隐藏
                                    [02:08.16]我用力的歌唱
                                    [03:16.60]我知道你听得到
                                    [03:19.48]我活着
                                    [03:21.06]我为爱活着
                                    [03:28.24]我知道你听得到
                                    [03:30.91]我活着
                                    [03:32.44]我为爱活着
`
                    },
                    {
                        name: '母系社会',
                        artist: '张惠妹',
                        cover: require('../public/audio/AMIT2.jpg'),
                        url: require('../public/audio/mxsh.mp3'),
                        lrc: `[00:01.16]母系社会 - 张惠妹[00:15.98]我不会耕田吃草让人下注[00:19.42]什么理由发明什么叫马子[00:23.17]难道是想让匹马为你生个儿子[00:30.52]我没有兄弟聚会那些幌子[00:34.12]还可以煮好宵夜当做没事[00:37.85]仔细想想你就会知道谁才是傻子[00:44.50]我笑得柔软 心却比铁还钢[00:51.97]世界男人称王 女人却什么都扛[00:59.42]不要再说要进厨房能出厅堂[01:03.29]不要再说要会铺床又能着床[01:06.94]这个世界没有女人该怎么办[01:10.72]你想 你想[01:14.41]不要以为西装革履就是战袍[01:18.01]不要以为浴帽围裙就是渺小[01:21.71]信以为真连续剧里的那一套[01:25.49]皇上 吉祥[01:29.15]简直可笑[01:37.26]我记得你最喜欢哪双袜子[01:40.58]朋友聚会演戏让你有面子[01:44.30]难道我没有发现你目测谁的[01:48.18]Size[01:51.48]我记得女娲补天岳母刺字[01:55.33]你只讲少说多做相夫教子[01:59.10]仔细算算最值钱的只是结婚戒指[02:05.81]我笑得柔软 心却比铁还钢[02:13.31]世界男人称王 女人却什么都扛[02:20.65]不要再要进厨房能出厅堂[02:24.50]不要再说要会铺床又能着床[02:28.12]这个世界没有女人该怎么办[02:32.21]你想 你想[02:35.54]不要以为西装革履就是战袍[02:39.16]不要以为浴帽围裙就是渺小[02:42.71]信以为真连续剧里的那一套[02:46.55]皇上 吉祥[02:50.15]简直可笑[03:05.16]你可以抱我重复爱我的台词[03:08.82]我不相信你有放弃我的[03:11.75]Guts[03:12.53]我无所谓女人就该是这样子[03:16.42]安静 该死[03:19.93]不要以为西装革履就是战袍[03:23.62]不要以为浴帽围裙就是渺小[03:27.20]信以为真连续剧里的那一套[03:31.35]皇上 吉祥[03:34.72]简直荒唐 无聊[03:43.60]荒唐 无聊[03:43.65]`
                    },
                    {
                        name: '牙买加的槟榔',
                        artist: '张惠妹',
                        cover: require('../public/audio/AMIT2.jpg'),
                        url: require('../public/audio/ymjdbl.mp3'),
                        lrc: `[ver:v1.0]
[ti:才]
[00:01.09]牙买加的槟榔 - 张惠妹
[00:03.28]词：阿弟仔
[00:04.45]曲：阿弟仔
[01:21.48]床吊在棕榈树上
[01:24.61]摇着摇着灵魂放电
[01:28.19]我沿着加勒比海
[01:31.33]一圈一圈不停的飞
[01:35.15]我遇见巴布马利
[01:38.12]他帮我卷了一根烟
[01:42.02]我们一起聊天
[01:45.10]飞呀飞呀变成蝴蝶
[01:48.96]我说雷鬼 papa
[01:51.61]我叫做阿密特啊
[01:53.21]我送你台东的槟榔
[01:55.91]他说雷鬼 papa
[01:58.29]什么都没在怕啦
[01:59.95]现在就可以嚼一嚼
[02:03.09]Get up stand up
[02:10.16]Get up stand up
[02:17.02]Get up stand up
[02:23.70]Get up stand up
[02:43.93]我说雷鬼 papa
[02:46.28]我们来自弹自唱
[02:47.89]我为你准备了 guitar
[02:50.79]他说阿密特啊
[02:53.11]让微笑慢动作吧
[02:54.86]感受我的标准时间
[02:58.47]牙买加的槟榔
[03:01.10]掉下来打到我的头
[03:05.41]牙买加的槟榔
[03:08.05]掉下来打到我的头
[03:12.39]牙买加的槟榔
[03:15.12]掉下来打到我的头
[03:19.61]牙买加的槟榔
[03:22.20]掉下来打到我的头
[03:26.37]Get up stand up
[03:33.15]Get up stand up
[03:40.03]Get up stand up
[03:46.80]Get up stand up`
                    },
                ]
            }
        },
        created() {
        },
        methods: {
            _initAPlayer() {
                 this.aPlayer = new APlayer({
                    container: document.getElementById('aplayer'),
                    mini: false,
                    autoplay: false,
                    theme: '#FADFA3',
                    loop: 'all',
                    order: 'random',
                    preload: 'auto',
                    volume: 0.7,
                    mutex: true,
                    listFolded: false,
                    listMaxHeight: 90,
                    lrcType: 1, // 3文件格式歌词 1，字符串
                    audio: this.musicList
                });
            }
        },
        computed: {},
        mounted() {
            this._initAPlayer()
        },
        components: {}
    }
</script>

<style scoped lang="scss">

</style>
